# YOLOv5 modified config without P2
# Parameters
nc: 80
depth_multiple: 1.0
width_multiple: 1.0
anchors: 3

# Backbone
backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],     # 0
   [-1, 1, Conv, [128, 3, 2]],       # 1
   [-1, 3, C3, [128]],               # 2
   [-1, 1, Conv, [256, 3, 2]],       # 3
   [-1, 6, C3, [256]],               # 4
   [-1, 1, Conv, [512, 3, 2]],       # 5
   [-1, 9, C3, [512]],               # 6
   [-1, 1, Conv, [1024, 3, 2]],      # 7
   [-1, 3, C3TR, [1024]],
   [-1, 1, SPPF, [1024, 5]],         # 9
  ]

# Head (no P2)
head:
  [[-1, 1, Conv, [512, 1, 1]],        # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],         # 12: upsample + backbone P4 (->64×64)
   [-1, 3, C3, [512, False]],         # 13

   [-1, 1, Conv, [256, 1, 1]],        # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],         # 16: upsample + backbone P3 (->128×128)
   [-1, 3, C3, [256, False]],         # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],        # 18: downsample to 64×64
   [[-1, 13], 1, Concat, [1]],        # 19: P4 connection
   [-1, 1, SPP, [512, [3, 7, 11]]],   # 20
   [-1, 3, C3, [512, False]],         # 21 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],        # 22: downsample to 32×32
   [[-1, 10], 1, Concat, [1]],        # 23: concat with high-res
   [-1, 1, SPP, [1024, [3, 5, 7]]],   # 24
   [-1, 3, C3TR, [1024, False]],      # 25 (P5/32-large)

   [[17, 21, 25], 1, Detect, [nc, anchors]],  # Detect from P3, P4, P5
  ]
