# YOLOv5 🚀 modified with P2 + ECA attention

nc: 80
depth_multiple: 1.0
width_multiple: 1.0
anchors: 4

backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C3TR, [1024]],
   [-1, 1, SPPF, [1024, 5]],
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],
   [-1, 1, ECA, [512]],            # replace CBAM

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],
   [-1, 1, ECA, [256]],            # replace CBAM

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 1, SPP, [128, [5, 9, 13]]],
   [-1, 3, C3, [128, False]],
   [-1, 1, ECA, [128]],            # replace CBAM

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 18, 4], 1, Concat, [1]],
   [-1, 1, SPP, [256, [5, 9, 13]]],
   [-1, 3, C3, [256, False]],
   [-1, 1, ECA, [256]],            # replace CBAM

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14, 6], 1, Concat, [1]],
   [-1, 1, SPP, [512, [3, 7, 11]]],
   [-1, 3, C3, [512, False]],
   [-1, 1, ECA, [512]],            # replace CBAM

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 1, SPP, [1024, [3, 5, 7]]],
   [-1, 3, C3TR, [1024, False]],
   [-1, 1, ECA, [1024]],           # replace CBAM

   [[23, 28, 33, 38], 1, Detect, [nc, anchors]]
  ]
